## Checking if a number is odd or even

In [3]:
a = int(input("Enter the number: "))
if a%2 == 0:
    print("Its an even number")
else:
    print("Its an odd number")

Enter the number11
Its an odd number

## Checking if the addition of two numbers is even or add

In [4]:
a = int(input("Enter the first number of fingers"))
b = int(input("Enter the second number of fingers"))
c = a+b
if c%2 == 0:
    print("Jack wins")
else:
    print("Jane wins")

Enter the first number of fingers12
Enter the second number of fingers5
Jane wins

# Creating Table for an observation

In [9]:
RD = [14,16,14,17,16,15,16,16,17,14]
Admin = [5.5,6,5.4,5.9,5.6,5.7,5.9,5.8,6.1,5]
Spend = [80,85,70,60,76,85,74,87,75,68]
States = ["Ann", "Jane", "Joan", "Claire", "Elizabeth", "Charles", "Jude", "James", "Kelvin", "Prosper"]
Profit = [8,5,0,6,7,1,4,3,2,6]
tab = {"R&D Spend": RD, "Administration": Admin, "Marketing Spend": Spend, "State": States, "Profit": Profit}
tab
import pandas
# import math
# # dir(pandas)
# math.sin(4/(2*360.0*math.pi))
# dir(pandas)
data = pandas.DataFrame(tab)
# data.head(5)
print(data)
data.to_excel('data2.xlsx', index+=1)

0.019893055594160904

In [12]:
data.head(5)

   R&D Spend  Administration  Marketing Spend      State  Profit
0         14             5.5               80        Ann       8
1         16             6.0               85       Jane       5
2         14             5.4               70       Joan       0
3         17             5.9               60     Claire       6
4         16             5.6               76  Elizabeth       7

In [13]:
data.tail(5)

   R&D Spend  Administration  Marketing Spend    State  Profit
5         15             5.7               85  Charles       1
6         16             5.9               74     Jude       4
7         16             5.8               87    James       3
8         17             6.1               75   Kelvin       2
9         14             5.0               68  Prosper       6

In [15]:
data.columns

Index(['R&D Spend', 'Administration', 'Marketing Spend', 'State', 'Profit'], dtype='object')

### To read the excel in python

In [16]:
pandas.read_excel("data2.xlsx")

   R&D Spend  Administration  Marketing Spend      State  Profit
0         14             5.5               80        Ann       8
1         16             6.0               85       Jane       5
2         14             5.4               70       Joan       0
3         17             5.9               60     Claire       6
4         16             5.6               76  Elizabeth       7
5         15             5.7               85    Charles       1
6         16             5.9               74       Jude       4
7         16             5.8               87      James       3
8         17             6.1               75     Kelvin       2
9         14             5.0               68    Prosper       6

## Checking speed in km/hr

In [5]:
a = float(input("Enter the distance in miles: "))
b = float(input("Enter the time taken to cover the distance: "))
c = a/1.60934
d = c/b
print("The speed of the car in km/hr is: ", d)

Enter the distance in miles: 34567
Enter the time taken to cover the distance: 89
The speed of the car in km/hr is:  241.33698188509965

## Solving quadratic equation

In [2]:
a = float(input("Enter the value of a"))
b = float(input("Enter the value of b"))
c = float(input("Enter the value of c"))
d = (b**2)-(4*a*c)
x1 = (-b + (d**(0.5)))
x2 = (-b - (d**(0.5)))
if d == 0:
    print(x1)
else:
    print(x1, x2)

Enter the value of a1
Enter the value of b5
Enter the value of c-2
0.7445626465380286 -10.744562646538029